In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("/Users/mugunthansaravanan/Desktop/Project/Datasets/house_price.csv")
df.head()

       Location  BHK  Furnishing  Sq.ft  Old(years)  Floor  Price
0  Bommanahalli    3           1   3000           1      3  28000
1  Bommanahalli    3           1   1650          10      0  18000
2    Whitefield    2           0   1000           5      3  16400
3    Whitefield    3           0   1600           1      9  27000
4    Whitefield    2           1   1200           5      1  20000

In [3]:
df.columns

Index(['Location', 'BHK', 'Furnishing', 'Sq.ft', 'Old(years)', 'Floor',
       'Price'],
      dtype='object')

In [4]:
df['Location'].unique()

array(['Bommanahalli', 'Whitefield'], dtype=object)

In [5]:
df['Location'].value_counts()

Bommanahalli    504
Whitefield      496
Name: Location, dtype: int64

In [6]:
df.isnull().sum()

Location      0
BHK           0
Furnishing    0
Sq.ft         0
Old(years)    0
Floor         0
Price         0
dtype: int64

In [7]:
df.shape

(1000, 7)

In [8]:
df[:5]

       Location  BHK  Furnishing  Sq.ft  Old(years)  Floor  Price
0  Bommanahalli    3           1   3000           1      3  28000
1  Bommanahalli    3           1   1650          10      0  18000
2    Whitefield    2           0   1000           5      3  16400
3    Whitefield    3           0   1600           1      9  27000
4    Whitefield    2           1   1200           5      1  20000

In [9]:
from sklearn.preprocessing import LabelEncoder
LE=LabelEncoder()

In [10]:
df["Location"]=LE.fit_transform(df["Location"])
df

     Location  BHK  Furnishing  Sq.ft  Old(years)  Floor  Price
0           0    3           1   3000           1      3  28000
1           0    3           1   1650          10      0  18000
2           1    2           0   1000           5      3  16400
3           1    3           0   1600           1      9  27000
4           1    2           1   1200           5      1  20000
..        ...  ...         ...    ...         ...    ...    ...
995         0    3           1   1460           1      2  25000
996         1    3           0   2100           1      7  28000
997         0    2           0   1033           5      0  16500
998         0    3           0   1500          10      1  22000
999         1    3           1   1768           5     11  30000

[1000 rows x 7 columns]

In [20]:
X=df.drop(columns=["Price"],axis=1)
y=df["Price"]

y.shape

(1000,)

In [12]:
X[:10]

   Location  BHK  Furnishing  Sq.ft  Old(years)  Floor
0         0    3           1   3000           1      3
1         0    3           1   1650          10      0
2         1    2           0   1000           5      3
3         1    3           0   1600           1      9
4         1    2           1   1200           5      1
5         1    3           1   1760           5      8
6         1    3           1   1870          10      3
7         1    3           0   2200           1     10
8         1    3           0   2100           1      7
9         1    3           0   1704           5     13

In [13]:
y[:10]

0    28000
1    18000
2    16400
3    27000
4    20000
5    39500
6    35000
7    42000
8    28000
9    35000
Name: Price, dtype: int64

In [14]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=4)
X_train.head()

     Location  BHK  Furnishing  Sq.ft  Old(years)  Floor
608         0    3           0   1500          10      1
511         1    3           0   2117           1      0
641         0    3           1   1471          10      3
112         0    2           0    960          10      3
535         1    3           1   1870          10      3

In [15]:
from sklearn.ensemble import RandomForestClassifier
forest = RandomForestClassifier()
forest.fit(X_train, y_train)

RandomForestClassifier()

In [16]:
forest.score(X_train, y_train)

1.0

In [17]:
pred=forest.predict(X_test)
pred[:10]

array([39500, 17000, 25000, 15500, 24000, 16000, 20000, 28000, 26000,
       19500])

In [18]:
y_test[:10]

698    39500
577    17000
763    25000
790    15500
520    24000
825    16000
958    20000
996    28000
817    26000
152    19500
Name: Price, dtype: int64

In [19]:
from sklearn.metrics import accuracy_score
accuracy_score(y_test,pred)*100

100.0